/*
 Сделать страницу сохранения пользователей.

 Посетитель заходит на страницу, появляется окно с вопросом - ‘Какое кол-во пользователей вы хотите добавить?’,

 Указанное кол-во раз появляется окно, где через запятую указывается имя, возвраст, профессия.

 Данные записываются в массив типа [{name: 'Петя', age: 12 ... }, ..., { ... }]

 После появляется окно где можно указать по какому полю(ключу) сортировать

 Результат в отсотированном виде, выводится в специальном div c id result.

 Дополнительное задание.

 Если в поле сортировки ввести Sum {имя поля}:

 {имя поля} = age вывести суммарный возвраст

 {имя поля} != age вывести все значения введенного поля отсортированные через запятую.
 */

'use strict';